#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-qY5g8TpUU8FRaiSV

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.agencies_lambda.data.archive_file.agencies_source: Refreshing...
module.agencies_lambda.data.archive_file.agencies_source: Refresh complete after 0s [id=5304c30dd8565ef92c62720e32a718bfa6a5a53a]
module.agencies_lambda.aws_s3_object.agencies_s3_bucket: Refreshing state... [id=agencies_lambda.zip]
module.iam_maxfrise_lambdas.aws_iam_role.iam_maxfrise_lambdas: Refreshing state... [id=iam_maxfrise_lambdas]
module.maxfrise_api_gateway.aws_api_gateway_rest_api.maxfrise_api: Refreshing state... [id=8hbmj9nmrj]
module.dynamoDB_agencies_prod_table.aws_dynamodb_table.agencies_prod: Refreshing state... [id=agencies-prod-table]
module.dynamoDB_agencies_test_table.aws_dynamodb_table.agencies_test: Refreshing state... [id=agencies-test-table]
module.maxfrise_api_gateway.aws_api_gateway_resource.agencies_resource: Refreshing state... [id=udh18b]
module.agencies_lambda.aws_lambda_function.agencies_lambda: Refreshing state... [id=agencies_lambda]
module.maxfrise_api_gateway.aws_api_gateway_method.agencies_resource_method: Refreshing state... [id=agm-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration_request: Refreshing state... [id=agi-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_gateway.aws_lambda_permission.agencies_api_lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_test_deployment: Refreshing state... [id=x3fdqk]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_prod_deployment: Refreshing state... [id=uq9zi6]
module.maxfrise_api_gateway.aws_api_gateway_stage.test: Refreshing state... [id=ags-8hbmj9nmrj-test]
module.maxfrise_api_gateway.aws_api_gateway_stage.prod: Refreshing state... [id=ags-8hbmj9nmrj-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.maxfrise_user_pool.aws_cognito_user_pool.users_pool will be created
  + resource "aws_cognito_user_pool" "users_pool" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "ACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "maxfrise_users"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Environment" = "production"
          + "Owner"       = "maxfrise"
          + "Terraform"   = "true"
        }
      + tags_all                   = {
          + "Environment" = "production"
          + "Owner"       = "maxfrise"
          + "Terraform"   = "true"
        }

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + email_configuration {
          + email_sending_account = "COGNITO_DEFAULT"
        }

      + schema {
          + attribute_data_type      = "Number"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "number_of_properties"
          + required                 = false

          + number_attribute_constraints {
              + max_value = "500"
              + min_value = "0"
            }
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = false
          + name                     = "email"
          + required                 = true
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = false
          + name                     = "name"
          + required                 = true
        }
    }

  # module.maxfrise_user_pool.aws_cognito_user_pool_client.client[0] will be created
  + resource "aws_cognito_user_pool_client" "client" {
      + access_token_validity                = 1
      + allowed_oauth_flows                  = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client = false
      + allowed_oauth_scopes                 = [
          + "email",
          + "openid",
          + "profile",
        ]
      + auth_session_validity                = 3
      + callback_urls                        = [
          + "https://www.maxfrise.com/callback",
        ]
      + client_secret                        = (sensitive value)
      + default_redirect_uri                 = "https://www.maxfrise.com/callback"
      + enable_token_revocation              = true
      + generate_secret                      = false
      + id                                   = (known after apply)
      + id_token_validity                    = 1
      + logout_urls                          = [
          + "https://www.maxfrise.com/logout",
        ]
      + name                                 = "maxfrise_web_client"
      + prevent_user_existence_errors        = (known after apply)
      + read_attributes                      = [
          + "address",
          + "birthdate",
          + "custom:number_of_properties",
          + "email",
          + "name",
          + "phone_number",
          + "picture",
          + "profile",
        ]
      + refresh_token_validity               = 60
      + supported_identity_providers         = [
          + "COGNITO",
        ]
      + user_pool_id                         = (known after apply)
      + write_attributes                     = [
          + "address",
          + "birthdate",
          + "custom:number_of_properties",
          + "email",
          + "name",
          + "phone_number",
          + "picture",
          + "profile",
        ]

      + token_validity_units {
          + access_token  = "hours"
          + id_token      = "hours"
          + refresh_token = "days"
        }
    }

  # module.maxfrise_user_pool.aws_cognito_user_pool_domain.domain will be created
  + resource "aws_cognito_user_pool_domain" "domain" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "maxfrise"
      + id                              = (known after apply)
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = (known after apply)
      + version                         = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @saudelog, Action: `pull_request`*